duxinglang-1/nRF9160_test/E2_V3_TEST/src/main.c
	LCD_MeasureString(cnbuf,&w,&h);
	x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
	y = y + h + 2;
	LCD_ShowString(x,y,cnbuf);
	
	LCD_MeasureString(jpbuf,&w,&h);
	x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
	y = y + h + 2;
	LCD_ShowString(x,y,jpbuf);

#if 0
#ifdef FONT_24
	LCD_SetFontSize(FONT_SIZE_24);					//设置字体大小
#endif
	LCD_MeasureString(cnbuf,&w,&h);
	x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
	y = y + h + 2;	
	LCD_ShowString(x,y,cnbuf);
	
	LCD_MeasureString(enbuf,&w,&h);
	x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
	y = y + h + 2;	
	LCD_ShowString(x,y,enbuf);

#ifdef FONT_32
	LCD_SetFontSize(FONT_SIZE_32);					//设置字体大小
#endif
	LCD_MeasureString(cnbuf,&w,&h);
	x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
	y = y + h + 2;	
	LCD_ShowString(x,y,cnbuf);
	
	LCD_MeasureString(enbuf,&w,&h);
	x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
	y = y + h + 2;
	LCD_ShowString(x,y,enbuf);
#endif
#endif
}

void test_notify(void)
{
	notify_infor infor = {0};
	uint16_t str_note[LANGUAGE_MAX][80] = {
											{0x0054,0x0068,0x0065,0x0020,0x0074,0x0069,0x006D,0x0069,0x006E,0x0067,0x0020,0x006D,0x0065,0x0061,0x0073,0x0075,0x0072,0x0065,0x006D,0x0065,0x006E,0x0074,0x0020,0x0069,0x0073,0x0020,0x0061,0x0062,0x006F,0x0075,0x0074,0x0020,0x0074,0x006F,0x0020,0x0073,0x0074,0x0061,0x0072,0x0074,0x002C,0x0020,0x0061,0x006E,0x0064,0x0020,0x0074,0x0068,0x0069,0x0073,0x0020,0x006D,0x0065,0x0061,0x0073,0x0075,0x0072,0x0065,0x006D,0x0065,0x006E,0x0074,0x0020,0x0069,0x0073,0x0020,0x006F,0x0076,0x0065,0x0072,0x0021,0x0000},//The timing measurement is about to start, and this measurement is over!
											{0x0044,0x0069,0x0065,0x0020,0x005A,0x0065,0x0069,0x0074,0x006D,0x0065,0x0073,0x0073,0x0075,0x006E,0x0067,0x0020,0x0073,0x0074,0x0065,0x0068,0x0074,0x0020,0x006B,0x0075,0x0072,0x007A,0x0020,0x0062,0x0065,0x0076,0x006F,0x0072,0x002C,0x0020,0x0075,0x006E,0x0064,0x0020,0x0064,0x0069,0x0065,0x0073,0x0065,0x0020,0x004D,0x0065,0x0073,0x0073,0x0075,0x006E,0x0067,0x0020,0x0069,0x0073,0x0074,0x0020,0x0076,0x006F,0x0072,0x0062,0x0065,0x0069,0x0021,0x0000},//Die Zeitmessung steht kurz bevor, und diese Messung ist vorbei!
											{0x5B9A,0x65F6,0x6D4B,0x91CF,0x5373,0x5C06,0x5F00,0x59CB,0xFF0C,0x672C,0x6B21,0x6D4B,0x91CF,0x7ED3,0x675F,0xFF01,0x0000},//定时测量即将开始，本次测量结束！
										};

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_20);
#else		
	LCD_SetFontSize(FONT_SIZE_16);
#endif
	
	infor.x = 0;
	infor.y = 0;
	infor.w = LCD_WIDTH;
	infor.h = LCD_HEIGHT;

	infor.align = NOTIFY_ALIGN_CENTER;
	infor.type = NOTIFY_TYPE_POPUP;

	infor.img_count = 0;
	mmi_ucs2cpy(infor.text, (uint8_t*)str_note[0]);

	DisplayPopUp(infor);
}

static void modem_init(void)
{
	nrf_modem_lib_init(NORMAL_MODE);
	boot_write_img_confirmed();
}

void system_init(void)
{
	k_sleep(K_MSEC(500));//xb test 2022-03-11 启动时候延迟0.5S,等待其他外设完全启动

	modem_init();

#ifdef CONFIG_FOTA_DOWNLOAD
	fota_init();
#endif

	InitSystemSettings();

#ifdef CONFIG_IMU_SUPPORT
	init_imu_int1();//xb add 2022-05-27
#endif
#ifdef CONFIG_PPG_SUPPORT
	PPG_i2c_off();
#endif
	pmu_init();
	key_init();
	LCD_Init();
	flash_init();
	
	ShowBootUpLogo();
	
#ifdef CONFIG_PPG_SUPPORT	
	PPG_init();
#endif
#ifdef CONFIG_AUDIO_SUPPORT	
	audio_init();
#endif
	ble_init();
#ifdef CONFIG_WIFI_SUPPORT
	wifi_init();
#endif
#ifdef CONFIG_IMU_SUPPORT
	IMU_init(&imu_work_q);
#endif
#ifdef CONFIG_TEMP_SUPPORT
	temp_init();
#endif
#ifdef CONFIG_DATA_DOWNLOAD_SUPPORT
	dl_init();
#endif

	//log_read_from_flash();

	NB_init(&nb_work_q);
	GPS_init(&gps_work_q);
}

void work_init(void)
{
	k_work_q_start(&nb_work_q, nb_stack_area,
					K_THREAD_STACK_SIZEOF(nb_stack_area),
					CONFIG_APPLICATION_WORKQUEUE_PRIORITY);
#ifdef CONFIG_IMU_SUPPORT	
	k_work_q_start(&imu_work_q, imu_stack_area,
					K_THREAD_STACK_SIZEOF(imu_stack_area),
					CONFIG_APPLICATION_WORKQUEUE_PRIORITY);
#endif
	k_work_q_start(&gps_work_q, gps_stack_area,
					K_THREAD_STACK_SIZEOF(gps_stack_area),
					CONFIG_APPLICATION_WORKQUEUE_PRIORITY);	
	
	if(IS_ENABLED(CONFIG_WATCHDOG))
	{
		watchdog_init_and_start(&k_sys_work_q);
	}
}

bool system_is_completed(void)
{
	return sys_pwron_completed_flag;
}

void system_init_completed(void)
{
	if(!sys_pwron_completed_flag)
		sys_pwron_completed_flag = true;
}

void system_pwron_infor(void)
{
	/* Show last reset reason */
	uint32_t reas;
	
#if NRF_POWER_HAS_RESETREAS
	reas = nrf_power_resetreas_get(NRF_POWER);
	nrf_power_resetreas_clear(NRF_POWER, reas);
	if(reas & NRF_POWER_RESETREAS_RESETPIN_MASK)
	{
		LOGD("Reset from pin reset detected");
	}
	else if(reas & NRF_POWER_RESETREAS_DOG_MASK)
	{
		LOGD("Reset from global watchdog detected");
	}
	else if(reas & NRF_POWER_RESETREAS_SREQ_MASK)
	{
		LOGD("Reset from AIRCR.SYSRESETREQ detected");
	}
	else if(reas & NRF_POWER_RESETREAS_LOCKUP_MASK)
	{
		LOGD("Reset from CPU lock-up detected");
	}
	else if(reas & NRF_POWER_RESETREAS_OFF_MASK)
	{
		LOGD("Reset due to wakeup from System OFF mode, when wakeup is triggered by DETECT signal from GPIO");
	}
#if defined(POWER_RESETREAS_LPCOMP_Msk) || defined(__NRFX_DOXYGEN__)	
	else if(reas & NRF_POWER_RESETREAS_LPCOMP_MASK)
	{
		LOGD("Reset due to wake up from System OFF mode when wakeup is triggered from ANADETECT signal from LPCOMP");
	}
#endif	
	else if(reas & NRF_POWER_RESETREAS_DIF_MASK)
	{
		LOGD("Reset due to wakeup from System OFF mode, when wakeup is triggered by entering debug interface mode");
	}
#if defined(POWER_RESETREAS_NFC_Msk) || defined(__NRFX_DOXYGEN__)	
	else if(reas & NRF_POWER_RESETREAS_NFC_MASK)
	{
		LOGD("Reset due to wake up from System OFF mode by NFC field detect");
	}
#endif	
#if defined(POWER_RESETREAS_VBUS_Msk) || defined(__NRFX_DOXYGEN__)
	else if(reas & NRF_POWER_RESETREAS_VBUS_MASK)
	{
		LOGD("Reset due to wake up from System OFF mode by VBUS rising into valid range");
	}
#endif	
	else if(reas)
	{
		LOGD("Reset by a different source (0x%08X)", reas);
	}
	else
	{
		LOGD("Power-on-reset");
	}
	
#else

	reas = nrf_reset_resetreas_get(NRF_RESET);
	nrf_reset_resetreas_clear(NRF_RESET, reas);

	if(reas & NRF_RESET_RESETREAS_RESETPIN_MASK)
	{
		LOGD("Reset from pin reset detected");
	}
	else if(reas & NRF_RESET_RESETREAS_DOG0_MASK)
	{
		LOGD("Reset from application watchdog timer 0 detected");
	}
	else if(reas & NRF_RESET_RESETREAS_CTRLAP_MASK)
	{
		LOGD("Reset from application CTRL-AP detected");
	}
	else if(reas & NRF_RESET_RESETREAS_SREQ_MASK)
	{
		LOGD("Reset from application soft reset detected");
	}
	else if(reas & NRF_RESET_RESETREAS_LOCKUP_MASK)
	{
		LOGD("Reset from application CPU lockup detected");
	}
	else if(reas & NRF_RESET_RESETREAS_OFF_MASK)
	{
		LOGD("Reset due to wakeup from System OFF mode when wakeup is triggered by DETECT signal from GPIO");
	}
	else if(reas & NRF_RESET_RESETREAS_LPCOMP_MASK)
	{
		LOGD("Reset due to wakeup from System OFF mode when wakeup is triggered by ANADETECT signal from LPCOMP");
	}
	else if(reas & NRF_RESET_RESETREAS_DIF_MASK)
	{
		LOGD("Reset due to wakeup from System OFF mode when wakeup is triggered by entering the Debug Interface mode");
	}
#if NRF_RESET_HAS_NETWORK	
	else if(reas & NRF_RESET_RESETREAS_LSREQ_MASK)
	{
		LOGD("Reset from network soft reset detected");
	}
	else if(reas & NRF_RESET_RESETREAS_LLOCKUP_MASK)
	{
		LOGD("Reset from network CPU lockup detected");
	}
	else if(reas & NRF_RESET_RESETREAS_LDOG_MASK)
	{
		LOGD("Reset from network watchdog timer detected");
	}
	else if(reas & NRF_RESET_RESETREAS_MFORCEOFF_MASK)
	{
		LOGD("Force-OFF reset from application core detected");
	}
#endif
	else if(reas & NRF_RESET_RESETREAS_NFC_MASK)
	{
		LOGD("Reset after wakeup from System OFF mode due to NFC field being detected");
	}
	else if(reas & NRF_RESET_RESETREAS_DOG1_MASK)
	{
		LOGD("Reset from application watchdog timer 1 detected");
	}
	else if(reas & NRF_RESET_RESETREAS_VBUS_MASK)
	{
		LOGD("Reset after wakeup from System OFF mode due to VBUS rising into valid range");
	}
#if NRF_RESET_HAS_NETWORK	
	else if(reas & NRF_RESET_RESETREAS_LCTRLAP_MASK)
	{
		LOGD("Reset from network CTRL-AP detected");
	}
#endif
	else if(reas)
	{
		LOGD("Reset by a different source (0x%08X)", reas);
	}
	else
	{
		LOGD("Power-on-reset");
	}
#endif
}

/***************************************************************************
* 描  述 : main函数 
* 入  参 : 无 
* 返回值 : int 类型
**************************************************************************/
int main(void)
{
	//system_pwron_infor();
	work_init();
	system_init();

//	test_show_string();
//	test_show_image();
//	test_show_color();
//	test_show_stripe();
//	test_nvs();
//	test_flash();
//	test_uart_ble();
//	test_sensor();
//	test_show_digital_clock();
//	test_sensor();
//	test_pmu();
//	test_crypto();
//	test_imei_for_qr();
//	test_tp();
//	test_gps_on();
//	test_nb();
//	test_i2c();
//	test_bat_soc();
//	test_notify();
//	test_wifi();
//	LogInit();

	while(1)
	{
		KeyMsgProcess();
		TimeMsgProcess();
		NBMsgProcess();
		GPSMsgProcess();
		PMUMsgProcess();
	#ifdef CONFIG_IMU_SUPPORT	
		IMUMsgProcess();
	#ifdef CONFIG_FALL_DETECT_SUPPORT
		FallMsgProcess();
	#endif
	#endif
	#ifdef CONFIG_PPG_SUPPORT	
		PPGMsgProcess();
	#endif
		LCDMsgProcess();
	#ifdef CONFIG_TOUCH_SUPPORT
		TPMsgProcess();
	#endif
	#ifdef CONFIG_ALARM_SUPPORT
		AlarmMsgProcess();
	#endif
		SettingsMsgPorcess();
		SOSMsgProc();
	#ifdef CONFIG_WIFI_SUPPORT
		WifiMsgProcess();
	#endif
		UartMsgProc();
	#ifdef CONFIG_ANIMATION_SUPPORT
		AnimaMsgProcess();
	#endif		
		ScreenMsgProcess();
	#ifdef CONFIG_DATA_DOWNLOAD_SUPPORT
		DlMsgProc();
	#endif
	#ifdef CONFIG_FOTA_DOWNLOAD
		FotaMsgProc();
	#endif
	#ifdef CONFIG_AUDIO_SUPPORT
		AudioMsgProcess();
	#endif
	#ifdef CONFIG_SYNC_SUPPORT
		SyncMsgProcess();
	#endif
	#ifdef CONFIG_TEMP_SUPPORT
		TempMsgProcess();
	#endif
	#ifdef CONFIG_FACTORY_TEST_SUPPORT
		FactoryTestProccess();
	#endif
		LogMsgProcess();
		system_init_completed();
		k_cpu_idle();
	}
}
